def add(a, b):
    """
    Функция для сложения двух чисел.
    
    :param a: Первое число
    :param b: Второе число
    :return: Сумма чисел a и b
    """
    return a + b


def subtract(a, b):
    """
    Функция для вычитания второго числа из первого.
    
    :param a: Уменьшаемое число
    :param b: Вычитаемое число
    :return: Разность чисел a и b
    """
    return a - b


def multiply(a, b):
    """
    Функция для умножения двух чисел.
    
    :param a: Первый множитель
    :param b: Второй множитель
    :return: Произведение чисел a и b
    """
    return a * b
